[{
    "workplace": "Codification",
    "role": "Sr. Software Engineer",
    "start": "2022",
    "end": "present",
    "summery": "Codification helps to build entirely new cloud native platforms from the ground up, for both large and small-scale projects. I have joined Codification on a part-time basis to support projects with narrow deadlines.",
    "work": [
        "Specialization in .Net and Angular",
        "Attend daily SCRUM and implement changes",
        "Recommend fixes and refactoring in existing codebase",
        "Lift & shift existing systems to Azure Cloud"
    ],
    "responsibilities": [

    ],
    "skills": ["Azure AAD", "Angular", ".NET"]
},
{
    "workplace": "Ambitious Developers",
    "role": "Director",
    "start": "2018",
    "end": "present",
    "summery": "Have founded the company along with a partner to provide support for international and local businesses to adapt latest technology to increase productivity. My duties are varying from project development, presenting proposals to handling payrolls.",
    "work": [
        "Development of Chint Rewards System for Chint Electricals",
        "Project management of health clinic app to place appointments for doctors based on symptoms",
        "Worked with award winning advertising agencies to produce multiple projects in collaboration",
        "Development of online order processing and warranty tracking system for Brother Industries Ltd"
    ],
    "responsibilities": [
        "Engaging with clients, collecting requirements and negotiating development features.",
        "Preparing and presenting winning proposals.",
        "Managing development team in-house & remote.",
        "Developing systems architecture and WBS.",
        "Representing business in local conventions and meeting potential clients.",
        "Contracting with advertising agencies to produce innovative products."
    ],
    "skills": ["Codeigniter", "PHP", "Angular","Wordpress","Android Development","Google Cloud Platform"]
},
{
    "workplace": "Pixecom (Pvt) Ltd",
    "role": "Technoprenuer",
    "start": "2014",
    "end": "2017",
    "summery": "I have joined Pixecom (Pvt) Ltd as an associate developer and gradually promoted to senior positions as I was able to fully take over the project left by the previous development team and lead it towards achieving excellence",
    "work": [
        "Development of Pixecom CRM and setup to run operation of call centre",
        "Product Developer of Bookprices.lk (Web & App), lets you search for any type of book and make it delivered to doorstep",
        "Re-archicect the freamwork of marketplace software to sell used books",
        "Develop management platform for staff"
    ],
    "responsibilities": [
        "Manage multiple in-house development projects with liaising customer requirement",
        "Engaging with top management to develop innovative and competitive software products",
        "Manage work of developers and other IT staff",
        "Change and make the systems adopt ever changing business case",
        "Run tests on live system"
    ],
    "skills": ["Codeigniter", "Kohana", "Angular","IP PBX",".NET","SCRUM","Trello"]
},
{
    "workplace": "Clicqd",
    "role": "Software Engineer",
    "start": "2012",
    "end": "2014",
    "summery": "During undergraduate studies, I have worked with peer colleagues with different skills in developing promotional websites and marketing content for local businesses",
    "work": [
        "Development of Hotel Management System",
        "Camping forum for UK travel agent",
        "Development of windows standalone apps for multiple clients",
        "Setup CMS, Magento E-Commerce Website",
        "Design UI & LOGO for clients"
    ],
    "responsibilities": [
        "Develop systems according to the requirements",
        "Communicate with team members and clients to laise with requirements"
    ],
    "skills": [".NET", "Silverlight", "Flash","","PHP","Smarty","Action Script"]
}
]